public/subjects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="index.html">Giovanni's Diary</a> &gt;
</p>

<div id="outline-container-org4b4a217" class="outline-2">
<h2 id="org4b4a217">Subjects</h2>
<div class="outline-text-2" id="text-org4b4a217">
<p>
You are in the subject page. This file serves as an hub to reach other
areas of interest of mine where I have written some notes. If you
prefer, you can also explore the diary <a href="autobiography/chronological.html">chronologically</a>.
</p>

<p>
I enjoy talking about <a href="programming/programming.html">programming</a>, in particular <a href="programming/linux/linux.html">linux</a>, and <a href="math/mathematics.html">math</a>. I
<a href="writing/writing.html">write</a> various things, such as notes on my <a href="reading/reading.html">readings</a> or <a href="writing/poetry/poetry.html">poetry</a>. Anything
else that I do goes in my <a href="stash/stash.html">stash</a>. At the end of each page you will find
the <a href="theindex.html">index</a> page which is useful to move around if you lost your way.
</p>

<p>
Additionally, I have various <a href="wishlist.html">wishlists</a> of future projects and <a href="feeds.html">RSS
Feeds</a>.
</p>

<p>
Feel free to <a href="contacts.html">contact me</a> any time.
</p>

<hr />

<p>
Travel: <a href="first-page.html">First Page</a>, <a href="theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
